---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ToposolidSubregionOverlap
source: html/352df961-884e-6e9f-013e-23662b0444ee.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ToposolidSubregionOverlap Property

Highlighted toposolid and sub-division overlap.

## Syntax (C#)
```csharp
public static FailureDefinitionId ToposolidSubregionOverlap { get; }
```